---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeRefsWarning
source: html/c87ca8f8-a230-2029-3913-b6f1e057f962.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DirectShapeFailures.CannotCreateDirectShapeRefsWarning Property

Cannot create reference objects for a DirectShape.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateDirectShapeRefsWarning { get; }
```